app/Http/Controllers/Web/Admin/DriverController.php

select * from `service_locations` where `active` = 1 and `service_locations`.`deleted_at` is null
select * from `drivers` where `approve` = 1 and `owner_id` is null and `drivers`.`deleted_at` is null
---
    public function index()
    {
        $page = trans('pages_names.drivers');
        $main_menu = 'drivers';
        $sub_menu = 'driver_details';
        $services = ServiceLocation::whereActive(true)->companyKey()->get();
        $approved = Driver::where('approve', true)->where('owner_id', null)->get();

select * from `service_locations` where `active` = 1 and `service_locations`.`deleted_at` is null
---
    public function approvalPending()
    {
        $page = trans('pages_names.drivers');
        $main_menu = 'drivers';
        $sub_menu = 'driver_approval_pending';
        $services = ServiceLocation::whereActive(true)->companyKey()->get();

select * from `service_locations` where `active` = 1 and `service_locations`.`deleted_at` is null
select * from `drivers` where `approve` = 1 and `owner_id` is null and `drivers`.`deleted_at` is null
---
    public function NeagtiveBalanceDrivers()
    {
        $page = trans('pages_names.negative_balance_drivers');
        $main_menu = 'drivers';
        $sub_menu = 'negative_balance_drivers';

        $services = ServiceLocation::whereActive(true)->companyKey()->get();
        $approved = Driver::where('approve', true)->where('owner_id', null)->get();