app/Http/Controllers/Web/Admin/ZoneController.php

    public function zoneEdit($id)
    {


        $zone = $this->zone->where('id', $id)->first();
        $page = trans('pages_names.add_zone');
        $main_menu = 'map';
        $sub_menu = 'zone';

        $services = ServiceLocation::companyKey()->active()->get();
---
select * from `zones` where `id` = '9e960b60-aa81-4ed4-84ba-d31710cac140' limit 1
select * from `service_locations` where `active` = 1 and `service_locations`.`deleted_at` is null