app/Models/Request/Request.php

select * from `request_places` where `request_places`.`request_id` = '0d1e1fb9-0bde-4349-8961-0db31f647dcd' and `request_places`.`request_id` is not null limit 1
select exists(select * from `request_places` where `request_places`.`request_id` = '0d1e1fb9-0bde-4349-8961-0db31f647dcd' and `request_places`.`request_id` is not null) as `exists`
---
    public function getPickLatAttribute()
    {
        if (!$this->requestPlace()->exists()) {

select exists(select * from `request_places` where `request_places`.`request_id` = '0d1e1fb9-0bde-4349-8961-0db31f647dcd' and `request_places`.`request_id` is not null) as `exists`
---
    public function getPickLngAttribute()
    {
        if (!$this->requestPlace()->exists()) {

select exists(select * from `request_places` where `request_places`.`request_id` = '0d1e1fb9-0bde-4349-8961-0db31f647dcd' and `request_places`.`request_id` is not null) as `exists`
---
    public function getDropLatAttribute()
    {
        if (!$this->requestPlace()->exists()) {

select exists(select * from `request_places` where `request_places`.`request_id` = '0d1e1fb9-0bde-4349-8961-0db31f647dcd' and `request_places`.`request_id` is not null) as `exists`
---
    public function getDropLngAttribute()
    {
        if (!$this->requestPlace()->exists()) {

select exists(select * from `request_places` where `request_places`.`request_id` = '0d1e1fb9-0bde-4349-8961-0db31f647dcd' and `request_places`.`request_id` is not null) as `exists`
---
    public function getPickAddressAttribute()
    {
        if (!$this->requestPlace()->exists()) {

select exists(select * from `request_places` where `request_places`.`request_id` = '0d1e1fb9-0bde-4349-8961-0db31f647dcd' and `request_places`.`request_id` is not null) as `exists`
---
    public function getDropAddressAttribute()
    {
        if (!$this->requestPlace()->exists()) {

select * from `vehicle_types` where `vehicle_types`.`id` = '30dc60f7-6dc2-4f07-89a9-6df26a3c6fe6' and `vehicle_types`.`deleted_at` is null limit 1
select * from `zone_types` where `zone_types`.`id` = '18580f24-f331-494e-8af6-dcba4267edd9' limit 1
select exists(select * from `vehicle_types` where `vehicle_types`.`id` = '30dc60f7-6dc2-4f07-89a9-6df26a3c6fe6' and `vehicle_types`.`deleted_at` is null) as `exists`
---
    public function getVehicleTypeNameAttribute()
    {
        if ($this->zoneType == null) {
            return null;
        }
        if (!$this->zoneType->vehicleType()->exists()) {

select exists(select * from `vehicle_types` where `vehicle_types`.`id` = '30dc60f7-6dc2-4f07-89a9-6df26a3c6fe6' and `vehicle_types`.`deleted_at` is null) as `exists`
---
    public function getVehicleTypeImageAttribute()
    {
        if ($this->zoneType == null) {
            return null;
        }
        if (!$this->zoneType->vehicleType()->exists()) {