app/Helpers/helpers.php

    function get_settings($key)
    {
        // if (Cache::has('setting_cache_set')) {
        //     return Cache::get($key)?:null;
        // } else {
        //     $array = set_settings();

        //     return Cache::get($key)?:null;
        // }

        return Setting::whereName($key)->pluck('value')->first();
---
select `value` from `settings` where `name` = 'google_map_key'

    function app_logo()
    {
        $setting = Setting::whereName('logo')->first();
---
select * from `settings` where `name` = 'logo' limit 1

    function app_name()
    {
        $setting = Setting::whereName('app_name')->first();
---
select * from `settings` where `name` = 'app_name' limit 1

    function fav_icon()
    {
        $setting = Setting::whereName('favicon')->first();
---
select * from `settings` where `name` = 'favicon' limit 1