app/Models/Admin/Driver.php

select * from `users` where `id` = '73' limit 1
---
    public function rating($user_id)
    {
        $rate=  User::where('id',$user_id)->first();